models/Users.php

SELECT * FROM `users` WHERE `username`='admin'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);

SELECT * FROM `users` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);